{
  "backend/main.mo": "Defines the core backend actor with project, user profile, logs, authorization mixins, and comparison utilities for various record types.",
  "backend/migration.mo": "Implements migration logic converting old user profiles to the new standardized role-based structure.",
  "feature_evidence.json": "Contains feature evidence metadata listing feature IDs, related files, components, and test mappings.",
  "frontend-file-summaries.txt": "Provides human‑written summaries of multiple frontend files for reference or tooling.",
  "frontend/index.css": "Global Tailwind base styling defining OKLCH brand color variables for light and dark mode.",
  "frontend/index.html": "Base HTML entrypoint mounting the React app root and loading the main TSX module.",
  "frontend/src/App.tsx": "Sets up the React Router structure, authentication gating, and global providers such as theming and toast notifications.",
  "frontend/src/components/admin/UserRoleManager.tsx": "Dialog component that assigns roles to users by principal ID using a mutation hook and UI inputs.",
  "frontend/src/components/daily-logs/InterruptionsEditor.tsx": "Component to add, list, and remove work interruptions, calculating duration from start and end times.",
  "frontend/src/components/daily-logs/PhotoUploader.tsx": "Image uploader that converts selected files to data URLs, displays previews, and allows removal.",
  "frontend/src/components/dashboard/DelayAlertPanel.tsx": "Analyzes recent project activity logs for performance delays and collects risk data across projects.",
  "frontend/src/components/layout/AppLayout.tsx": "Simple layout wrapper that renders a top navigation bar and main content container.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with routing, user display, logout handling, and responsive mobile menu.",
  "frontend/src/components/projects/CreateProjectDialog.tsx": "Modal form component for creating a project, handling validation, date conversion to bigint, and triggering the createProject mutation.",
  "frontend/src/components/projects/ProjectAssignmentsPanel.tsx": "Dialog for viewing assigned users and adding new users to a project via the assignUser mutation.",
  "frontend/src/components/reports/DprViewer.tsx": "Displays a formatted daily progress report with aggregated metrics and activity details for a selected project and date.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches the backend actor based on the current identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks to manage Internet Identity authentication, loading, login, and logout flows.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for profiles, projects, assignments, roles, and daily logs.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes with global base styles.",
  "frontend/src/lib/delayDetection.ts": "Analyzes daily logs to detect low-productivity delays per activity and returns alert objects.",
  "frontend/src/lib/pdf.ts": "Generates a printable HTML report for a project's daily logs using a popup print window.",
  "frontend/src/lib/roles.ts": "Provides role labels, normalization helpers, and role-checking utilities for standardized roles.",
  "frontend/src/lib/suggestions.ts": "Creates actionable suggestions based on delay alerts such as manpower, workflow, or interruption issues.",
  "frontend/src/lib/timeCalculations.ts": "Calculates hour differences and totals pause durations for interruptions.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider, importing global styles.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays project productivity analytics with selection controls and activity performance metrics.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen using Internet Identity with redirect on success and error handling via toasts.",
  "frontend/src/pages/auth/RegisterPage.tsx": "Registration flow that logs in via Internet Identity, collects user profile details, and saves them before redirecting to the dashboard.",
  "frontend/src/pages/DailyLogEntryPage.tsx": "Provides a full form for entering daily logs, including interruptions, photos, and submission handling.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard metrics, user greeting, quick actions, and project/log status cards using data from various query hooks.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with marketing content, feature highlights, and navigation buttons for login and registration.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows users to view and edit their profile details, save updates, and access change-password functionality.",
  "frontend/src/pages/PlanningPage.tsx": "Enables selecting a project and adding or saving planned activity targets with validation and form inputs.",
  "frontend/src/pages/ProjectsPage.tsx": "Shows all projects and provides admin actions such as creating new projects and managing user roles.",
  "frontend/src/pages/ReportsPage.tsx": "Page for generating daily progress reports by selecting a project and date, viewing filtered logs, and exporting a PDF.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL or session.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color variables, animations, and plugin setup.",
  "project_state.json": "Project metadata describing features, architecture, UI themes, roles, and requirements for the NirmaanIQ app."
}